In [1]:
import pandas as pd

# Load the dataset
df = pd.read_csv("school_records.csv")

# Show first few rows to understand the data
df.head()

,Index,School ID,Name,Address,City,Subject,Marks,Rank,Grade
0,0,107,Ivy,456 Oak Ave,New York,History,86.1,8,B
1,1,108,Alice,555 Birch Dr,Houston,Science,96.1,7,D
2,2,105,Charlie,444 Cedar Blvd,Chicago,History,81.4,1,B
3,3,107,Henry,678 Spruce Ct,New York,Science,82.9,8,B
4,4,102,Alice,789 Pine Ln,Miami,Math,62.2,8,D

In [2]:
print(df.isnull().sum())

Index        0
School ID    0
Name         0
Address      0
City         0
Subject      0
Marks        1
Rank         0
Grade        0
dtype: int64

In [3]:
print(df.dtypes)

Index          int64
School ID      int64
Name          object
Address       object
City          object
Subject       object
Marks        float64
Rank           int64
Grade         object
dtype: object

In [4]:
df['Marks'] = pd.to_numeric(df['Marks'], errors='coerce')

In [5]:
print(df.dtypes)

Index          int64
School ID      int64
Name          object
Address       object
City          object
Subject       object
Marks        float64
Rank           int64
Grade         object
dtype: object

In [6]:
mean_marks = df['Marks'].mean()
df['Marks'].fillna(mean_marks, inplace=True)

df['Marks'] = df['Marks'].round(1)

print(df.isnull().sum())

Index        0
School ID    0
Name         0
Address      0
City         0
Subject      0
Marks        0
Rank         0
Grade        0
dtype: int64

In [7]:
df['Grade'] = df['Grade'].str.upper()

print(df['Subject'].unique())

['History' 'Science' 'Math' 'English']

In [8]:
df.to_csv("cleaned_school_records.csv", index=False)

In [9]:
df.head()

,Index,School ID,Name,Address,City,Subject,Marks,Rank,Grade
0,0,107,Ivy,456 Oak Ave,New York,History,86.1,8,B
1,1,108,Alice,555 Birch Dr,Houston,Science,96.1,7,D
2,2,105,Charlie,444 Cedar Blvd,Chicago,History,81.4,1,B
3,3,107,Henry,678 Spruce Ct,New York,Science,82.9,8,B
4,4,102,Alice,789 Pine Ln,Miami,Math,62.2,8,D